{
    "2023-11-21": {
        "title": "Share a Bible verse on social media and discuss its relevance.",
        "verse": "Hebrews 4:12",
        "question": "How did the verse resonate with your online community?"
    },
    "2023-11-22": {
        "title": "Read a Psalm and use it as a basis for your prayer time.",
        "verse": "Psalm 27:1",
        "question": "What aspects of God's character are highlighted in the Psalm, and how can you apply them in your prayers?"
    },
    "2023-11-23": {
        "title": "Create a gratitude list inspired by verses from the Psalms.",
        "verse": "Psalm 100:4",
        "question": "What specific blessings can you thank God for today?"
    },
    "2023-11-24": {
        "title": "Explore a passage from the Gospels and reflect on Jesus' teachings.",
        "verse": "Matthew 5:3-12",
        "question": "How can you embody the qualities mentioned in the Beatitudes?"
    },
    "2023-11-25": {
        "title": "Study a parable from the New Testament and apply its lessons.",
        "verse": "Luke 15:11-32",
        "question": "What lessons can you draw from the Prodigal Son story and implement in your life?"
    },
    "2023-11-26": {
        "title": "Memorize a verse from the Book of Romans and meditate on its meaning.",
        "verse": "Romans 8:28",
        "question": "How can the assurance of God working all things for good impact your mindset?"
    },
    "2023-11-27": {
        "title": "Choose a verse from the Epistles and apply it in a real-life situation.",
        "verse": "Philippians 4:13",
        "question": "How can you rely on Christ's strength in a specific challenge you are facing?"
    },
    "2023-11-28": {
        "title": "Share a Bible verse with a friend and discuss its impact on your lives.",
        "verse": "Proverbs 27:17",
        "question": "How does the verse inspire positive change and growth in your friendship?"
    },
    "2023-11-29": {
        "title": "Explore a prophetic passage from the Old Testament and reflect on its relevance today.",
        "verse": "Isaiah 40:31",
        "question": "How does the promise of renewed strength encourage you in your current circumstances?"
    },
    "2023-11-30": {
        "title": "Create a vision board for your spiritual goals using verses from the New Testament.",
        "verse": "Philippians 3:13-14",
        "question": "How can these verses guide your vision and goals for the future?"
    }
}